<map version="freeplane 1.9.13">
<!--To view this file, download free mind mapping software Freeplane from https://www.freeplane.org -->
<node TEXT="Виды тестирования" FOLDED="false" ID="ID_922307589" CREATED="1389014903209" MODIFIED="1661002079817"><hook NAME="MapStyle">
    <properties fit_to_viewport="false" show_icon_for_attributes="true" show_note_icons="true" show_notes_in_map="false" edgeColorConfiguration="#808080ff,#ff0000ff,#0000ffff,#00ff00ff,#ff00ffff,#00ffffff,#7c0000ff,#00007cff,#007c00ff,#7c007cff,#007c7cff,#7c7c00ff"/>

<map_styles>
<stylenode LOCALIZED_TEXT="styles.root_node" STYLE="oval" UNIFORM_SHAPE="true" VGAP_QUANTITY="24 pt">
<font SIZE="24"/>
<stylenode LOCALIZED_TEXT="styles.predefined" POSITION="right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="default" ID="ID_271890427" ICON_SIZE="12 pt" COLOR="#000000" STYLE="fork">
<arrowlink SHAPE="CUBIC_CURVE" COLOR="#000000" WIDTH="2" TRANSPARENCY="200" DASH="" FONT_SIZE="9" FONT_FAMILY="SansSerif" DESTINATION="ID_271890427" STARTARROW="NONE" ENDARROW="DEFAULT"/>
<font NAME="SansSerif" SIZE="10" BOLD="false" ITALIC="false"/>
<richcontent CONTENT-TYPE="plain/auto" TYPE="DETAILS"/>
<richcontent TYPE="NOTE" CONTENT-TYPE="plain/auto"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.details"/>
<stylenode LOCALIZED_TEXT="defaultstyle.attributes">
<font SIZE="9"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.note" COLOR="#000000" BACKGROUND_COLOR="#ffffff" TEXT_ALIGN="LEFT"/>
<stylenode LOCALIZED_TEXT="defaultstyle.floating">
<edge STYLE="hide_edge"/>
<cloud COLOR="#f0f0f0" SHAPE="ROUND_RECT"/>
</stylenode>
<stylenode LOCALIZED_TEXT="defaultstyle.selection" BACKGROUND_COLOR="#afd3f7" BORDER_COLOR_LIKE_EDGE="false" BORDER_COLOR="#afd3f7"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.user-defined" POSITION="right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="styles.topic" COLOR="#18898b" STYLE="fork">
<font NAME="Liberation Sans" SIZE="10" BOLD="true"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.subtopic" COLOR="#cc3300" STYLE="fork">
<font NAME="Liberation Sans" SIZE="10" BOLD="true"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.subsubtopic" COLOR="#669900">
<font NAME="Liberation Sans" SIZE="10" BOLD="true"/>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.important" ID="ID_67550811">
<icon BUILTIN="yes"/>
<arrowlink COLOR="#003399" TRANSPARENCY="255" DESTINATION="ID_67550811"/>
</stylenode>
</stylenode>
<stylenode LOCALIZED_TEXT="styles.AutomaticLayout" POSITION="right" STYLE="bubble">
<stylenode LOCALIZED_TEXT="AutomaticLayout.level.root" COLOR="#000000" STYLE="oval" SHAPE_HORIZONTAL_MARGIN="10 pt" SHAPE_VERTICAL_MARGIN="10 pt">
<font SIZE="18"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,1" COLOR="#0033ff">
<font SIZE="16"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,2" COLOR="#00b439">
<font SIZE="14"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,3" COLOR="#990000">
<font SIZE="12"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,4" COLOR="#111111">
<font SIZE="10"/>
</stylenode>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,5"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,6"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,7"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,8"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,9"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,10"/>
<stylenode LOCALIZED_TEXT="AutomaticLayout.level,11"/>
</stylenode>
</stylenode>
</map_styles>
</hook>
<node TEXT="По целям" POSITION="right" ID="ID_1960847431" CREATED="1389014937779" MODIFIED="1661002079817" HGAP_QUANTITY="12.5 pt" VSHIFT_QUANTITY="-0.75 pt">
<node TEXT="Нефункциональное" ID="ID_1290008209" CREATED="1389015143005" MODIFIED="1660837038223" HGAP_QUANTITY="28.25 pt" VSHIFT_QUANTITY="3 pt"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Нефункциональное тестирование (non-functional testing)</b>&nbsp;&nbsp;- анализ атрибутов компонента или системы, не относящихся к функциональности, в соответствии с различными шкалами.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Анализ атрибутов компонента или системы, не относящихся к функциональности. (<b>ISTQB</b>)
      </li>
      <li>
        Проверка значений характеристик программного обеспечения в соответствии с различными шкалами.
      </li>
    </ol>
  </body>
</html></richcontent>
<node TEXT="Пользовательского интерфейса" ID="ID_1867633291" CREATED="1389015175977" MODIFIED="1389646117656"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; (user interface testing)</b>&#xa0; - &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x440;&#x435;&#x431;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x439; &#x43a; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x43e;&#x43c;&#x443; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x443;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x442;&#x440;&#x435;&#x431;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x439; &#x43a; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x449;&#x435;&#x43d;&#x438;&#x44e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x43d;&#x430; &#x44d;&#x43a;&#x440;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x445;, &#x43a; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43d;&#x438;&#x44e; &#x438; &#x43e;&#x444;&#x43e;&#x440;&#x43c;&#x43b;&#x435;&#x43d;&#x438;&#x44e; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x44b;&#x445; &#x441;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x43d;&#x438;&#x439;, &#x43a; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x430;&#x43c; &#x432;&#x432;&#x43e;&#x434;&#x430;, &#x43a; &#x440;&#x435;&#x430;&#x43a;&#x446;&#x438;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43d;&#x430; &#x432;&#x432;&#x43e;&#x434; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;, &#x43a; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43e;&#x442;&#x43a;&#x43b;&#x438;&#x43a;&#x430; &#x43d;&#x430; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x44b; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x438; &#x442;.&#x434;.
    </p>
    <p>
      &#x41a;&#x430;&#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x43e;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43f;&#x430;&#x440;&#x430;&#x43b;&#x43b;&#x435;&#x43b;&#x44c;&#x43d;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x43c;&#x443; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44e; &#x432;&#x441;&#x435;&#x445; &#x43e;&#x431;&#x44a;&#x435;&#x43a;&#x442;&#x43e;&#x432;, &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x432; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x445; &#x432;&#x43b;&#x438;&#x44f;&#x44e;&#x442; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x438;&#x439; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x41f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x440;&#x435;&#x431;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x439; &#x43a; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x43e;&#x43c;&#x443; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x443;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x442;&#x440;&#x435;&#x431;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x439; &#x43a; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x449;&#x435;&#x43d;&#x438;&#x44e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x43d;&#x430; &#x44d;&#x43a;&#x440;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x445;, &#x43a; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43d;&#x438;&#x44e; &#x438; &#x43e;&#x444;&#x43e;&#x440;&#x43c;&#x43b;&#x435;&#x43d;&#x438;&#x44e; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x44b;&#x445; &#x441;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x43d;&#x438;&#x439;, &#x43a; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x430;&#x43c; &#x432;&#x432;&#x43e;&#x434;&#x430;, &#x43a; &#x440;&#x435;&#x430;&#x43a;&#x446;&#x438;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43d;&#x430; &#x432;&#x432;&#x43e;&#x434; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;, &#x43a; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43e;&#x442;&#x43a;&#x43b;&#x438;&#x43a;&#x430; &#x43d;&#x430; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x44b; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x438; &#x442;.&#x434;. (<u>&#x421;&#x438;&#x43d;&#x438;&#x446;&#x44b;&#x43d; &#x438; &#x434;&#x440;.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Удобства использования" ID="ID_646606706" CREATED="1389015188266" MODIFIED="1389646102706"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x443;&#x434;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; (usability testing)</b>&#xa0; - &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x43e;&#x433;&#x43e;, &#x43d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43b;&#x435;&#x433;&#x43a;&#x43e; &#x43a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x44b;&#x439; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x435;&#x435; &#x43e;&#x441;&#x432;&#x43e;&#x438;&#x442;&#x44c;, &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44f; &#x43d;&#x435; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x443;&#x44e; &#x441;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x44e;&#x449;&#x443;&#x44e; (&#x441;&#x430;&#x43c;&#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x443;), &#x43d;&#x43e; &#x438; &#x435;&#x435; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x44e;. &#x410; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x43e;&#x433;&#x43e;, &#x43d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x44d;&#x444;&#x444;&#x435;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x43e; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x442;&#x44c; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;, &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44f; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x445; &#x43e;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;, &#x43d;&#x430;&#x43a;&#x43e;&#x43d;&#x435;&#x446;, &#x43d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x43e; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x437;&#x430;&#x441;&#x442;&#x440;&#x430;&#x445;&#x43e;&#x432;&#x430;&#x43d;&#x430; (&#x441; &#x442;&#x43e;&#x447;&#x43a;&#x438; &#x437;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x43e;&#x442;&#x435;&#x43d;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x441;&#x431;&#x43e;&#x435;&#x432;) &#x43e;&#x442; &#x43e;&#x448;&#x438;&#x431;&#x43e;&#x43a; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;.
    </p>
    <p>
      &#x41a;&#x430;&#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x43e;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43f;&#x430;&#x440;&#x430;&#x43b;&#x43b;&#x435;&#x43b;&#x44c;&#x43d;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x43c;&#x443; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44e; &#x432;&#x441;&#x435;&#x445; &#x43e;&#x431;&#x44a;&#x435;&#x43a;&#x442;&#x43e;&#x432;, &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x432; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x445; &#x432;&#x43b;&#x438;&#x44f;&#x44e;&#x442; &#x43d;&#x430; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x441; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x435;&#x43c;. &#x41f;&#x440;&#x438; &#x44d;&#x442;&#x43e;&#x43c; &#x43e;&#x442;&#x434;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x435; &#x442;&#x435;&#x441;&#x442;&#x44b; &#x43d;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x443; &#x443;&#x434;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x435;&#x43a;&#x442;&#x438;&#x440;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x43a;&#x440;&#x430;&#x439;&#x43d;&#x435; &#x440;&#x435;&#x434;&#x43a;&#x43e;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x41f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x43e;&#x433;&#x43e;, &#x43d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43b;&#x435;&#x433;&#x43a;&#x43e; &#x43a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x44b;&#x439; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x435;&#x435; &#x43e;&#x441;&#x432;&#x43e;&#x438;&#x442;&#x44c;, &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44f; &#x43d;&#x435; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x443;&#x44e; &#x441;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x44e;&#x449;&#x443;&#x44e; &#x2013; &#x441;&#x430;&#x43c;&#x443; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x443;, &#x43d;&#x43e; &#x438; &#x435;&#x435; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x44e;; &#x43d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x44d;&#x444;&#x444;&#x435;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x43e; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x442;&#x44c; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;, &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44f; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x445; &#x43e;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;; &#x43d;&#x430;&#x43a;&#x43e;&#x43d;&#x435;&#x446;, &#x43d;&#x430;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x43e; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x437;&#x430;&#x441;&#x442;&#x440;&#x430;&#x445;&#x43e;&#x432;&#x430;&#x43d;&#x430; (&#x441; &#x442;&#x43e;&#x447;&#x43a;&#x438; &#x437;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x43e;&#x442;&#x435;&#x43d;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x441;&#x431;&#x43e;&#x435;&#x432;) &#x43e;&#x442; &#x43e;&#x448;&#x438;&#x431;&#x43e;&#x43a; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;. (<u>SWEBOK</u>)
      </li>
      <li>
        &#x422;&#x435;&#x445;&#x43d;&#x438;&#x43a;&#x430;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x434;&#x43b;&#x44f; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x43a;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x442;&#x430; &#x43f;&#x43e;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x43e;&#x43c; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x435;&#x433;&#x43e; &#x43d;&#x430; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;&#x445;. &#x41c;&#x43e;&#x436;&#x435;&#x442; &#x440;&#x430;&#x441;&#x441;&#x43c;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43d;&#x435;&#x437;&#x430;&#x43c;&#x435;&#x43d;&#x438;&#x43c;&#x430;&#x44f; &#x43f;&#x440;&#x430;&#x43a;&#x442;&#x438;&#x43a;&#x430; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x443;&#x434;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;, &#x442;&#x430;&#x43a; &#x43a;&#x430;&#x43a; &#x43f;&#x440;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x435;&#x442; &#x434;&#x43e;&#x441;&#x442;&#x43e;&#x432;&#x435;&#x440;&#x43d;&#x443;&#x44e; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44e; &#x43e; &#x442;&#x43e;&#x43c;, &#x43a;&#x430;&#x43a; &#x438;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x440;&#x435;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x435; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x442; &#x441; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x43e;&#x439;. (<u>Nielsen</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Инсталляционное" ID="ID_1031450976" CREATED="1389015207475" MODIFIED="1389646072849"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x418;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (installation testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43d;&#x430;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x43d;&#x43e;&#x435; &#x43d;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x443; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e;&#x439; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438; &#x438; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438;, &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x43b;&#x438; &#x443;&#x434;&#x430;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x438; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x43e;&#x43c; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x43c; &#x438; &#x430;&#x43f;&#x43f;&#x430;&#x440;&#x430;&#x442;&#x43d;&#x43e;&#x43c; &#x43e;&#x43a;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x438;&#x438;, &#x430; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x440;&#x438;&#x437;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x435; &#x43e;&#x446;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43d;&#x438;&#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x44b; &#x438;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x442;&#x43e;&#x440;&#x430;.
    </p>
    <p>
      &#x41f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x434;&#x43b;&#x44f; &#x432;&#x441;&#x435;&#x445; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438;, &#x430; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x440;&#x438; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x435; &#x43f;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43a;&#x438;/&#x434;&#x438;&#x441;&#x43a;&#x430; &#x43f;&#x435;&#x440;&#x435;&#x434; &#x432;&#x44b;&#x43f;&#x443;&#x441;&#x43a;&#x43e;&#x43c; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43d;&#x430;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x43d;&#x43e;&#x435; &#x43d;&#x430; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x443; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e;&#x439; &#x438;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x438; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438;, &#x430; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x43b;&#x438; &#x443;&#x434;&#x430;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;. (<u>&#x41f;&#x440;&#x43e; &#x422;&#x435;&#x441;&#x442;&#x438;&#x43d;&#x433;</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Конфигурационное" ID="ID_1806224936" CREATED="1389015214982" MODIFIED="1661001856953"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Конфигурационное тестирование (configuration testing)</b>&nbsp;&nbsp;- тестирование, направленное на проверку работы программного обеспечения при различных конфигурациях системы (заявленных платформах, поддерживаемых драйверах, при различных конфигурациях компьютеров и системного программного обеспечения и т.д.).
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Специальный вид тестирования, направленный на проверку работы программного обеспечения при различных конфигурациях системы (заявленных платформах, поддерживаемых драйверах, при различных конфигурациях компьютеров и т.д.). (<u>Про Тестинг</u>)
      </li>
      <li>
        Проверка совместимости программы с теми конфигурациями оборудования и системного программного обеспечения, с которыми она должна работать. (<u>Канер и др.</u>)
      </li>
      <li>
        Проверка того, что программная система корректно работает на всем поддерживаемом аппаратном обеспечении и совместно с другими программными системами. (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Совместимости" ID="ID_438557044" CREATED="1389015223294" MODIFIED="1389646048814"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x43e;&#x432;&#x43c;&#x435;&#x441;&#x442;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; (compatibility testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x434;&#x43b;&#x44f; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44f; &#x441; &#x43a;&#x430;&#x43a;&#x438;&#x43c;-&#x43b;&#x438;&#x431;&#x43e; &#x43e;&#x43a;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c;. &#x41f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43f;&#x440;&#x438; &#x43f;&#x43e;&#x44f;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x438; &#x43d;&#x43e;&#x432;&#x44b;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x439; &#x43e;&#x431;&#x449;&#x435;&#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e; &#x438;&#x43b;&#x438; &#x434;&#x43b;&#x44f; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x43e;&#x433;&#x43e; &#x41f;&#x41e;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x434;&#x43b;&#x44f; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44f; &#x441; &#x43a;&#x430;&#x43a;&#x438;&#x43c;-&#x43b;&#x438;&#x431;&#x43e; &#x43e;&#x43a;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c;. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Надёжности и восстановления после сбоев" ID="ID_1205766235" CREATED="1389015232869" MODIFIED="1389646037932"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43d;&#x430;&#x434;&#x435;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x438; &#x432;&#x43e;&#x441;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x441;&#x431;&#x43e;&#x435;&#x432; (reliability and recovery testing)</b>&#xa0;- &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x442;&#x430; &#x441; &#x442;&#x43e;&#x447;&#x43a;&#x438; &#x437;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x43e;&#x442;&#x438;&#x432;&#x43e;&#x441;&#x442;&#x43e;&#x44f;&#x442;&#x44c; &#x438; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e; &#x432;&#x43e;&#x441;&#x441;&#x442;&#x430;&#x43d;&#x430;&#x432;&#x43b;&#x438;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x44b;&#x445; &#x441;&#x431;&#x43e;&#x435;&#x432;, &#x432;&#x43e;&#x437;&#x43d;&#x438;&#x43a;&#x448;&#x438;&#x445; &#x432; &#x441;&#x432;&#x44f;&#x437;&#x438; &#x441; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x430;&#x43c;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;, &#x43e;&#x442;&#x43a;&#x430;&#x437;&#x430;&#x43c;&#x438; &#x43e;&#x431;&#x43e;&#x440;&#x443;&#x434;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x438;&#x43b;&#x438; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x430;&#x43c;&#x438; &#x441;&#x432;&#x44f;&#x437;&#x438;. &#x41f;&#x440;&#x438; &#x430;&#x43d;&#x430;&#x43b;&#x438;&#x437;&#x435; &#x43f;&#x43e;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x432; &#x44d;&#x442;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e; &#x43e;&#x431;&#x440;&#x430;&#x449;&#x430;&#x442;&#x44c; &#x432;&#x43d;&#x438;&#x43c;&#x430;&#x43d;&#x438;&#x435; &#x43d;&#x430; &#x434;&#x432;&#x430; &#x444;&#x430;&#x43a;&#x442;&#x43e;&#x440;&#x430; - &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e; &#x43f;&#x43e;&#x442;&#x435;&#x440;&#x44c; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x435; &#x441;&#x431;&#x43e;&#x44f; &#x438; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x441;&#x431;&#x43e;&#x435;&#x43c; &#x438; &#x43f;&#x440;&#x43e;&#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x43d;&#x43e;&#x440;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x41f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x442;&#x430; &#x441; &#x442;&#x43e;&#x447;&#x43a;&#x438; &#x437;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x43e;&#x442;&#x438;&#x432;&#x43e;&#x441;&#x442;&#x43e;&#x44f;&#x442;&#x44c; &#x438; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e; &#x432;&#x43e;&#x441;&#x441;&#x442;&#x430;&#x43d;&#x430;&#x432;&#x43b;&#x438;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x44b;&#x445; &#x441;&#x431;&#x43e;&#x435;&#x432;, &#x432;&#x43e;&#x437;&#x43d;&#x438;&#x43a;&#x448;&#x438;&#x445; &#x432; &#x441;&#x432;&#x44f;&#x437;&#x438; &#x441; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x430;&#x43c;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;, &#x43e;&#x442;&#x43a;&#x430;&#x437;&#x430;&#x43c;&#x438; &#x43e;&#x431;&#x43e;&#x440;&#x443;&#x434;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x438;&#x43b;&#x438; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x430;&#x43c;&#x438; &#x441;&#x432;&#x44f;&#x437;&#x438; (&#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x43e;&#x442;&#x43a;&#x430;&#x437; &#x441;&#x435;&#x442;&#x438;). (<u>&#x41f;&#x440;&#x43e; &#x422;&#x435;&#x441;&#x442;&#x438;&#x43d;&#x433;</u>)
      </li>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43f;&#x443;&#x442;&#x435;&#x43c; &#x438;&#x43c;&#x438;&#x442;&#x430;&#x446;&#x438;&#x438; &#x441;&#x431;&#x43e;&#x435;&#x432; &#x43e;&#x431;&#x43e;&#x440;&#x443;&#x434;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x438;&#x43b;&#x438; &#x43e;&#x43a;&#x440;&#x443;&#x436;&#x430;&#x44e;&#x449;&#x435;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x43b;&#x438;&#x431;&#x43e; &#x441;&#x431;&#x43e;&#x435;&#x432; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;, &#x432;&#x44b;&#x437;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x432;&#x43d;&#x435;&#x448;&#x43d;&#x438;&#x43c;&#x438; &#x444;&#x430;&#x43a;&#x442;&#x43e;&#x440;&#x430;&#x43c;&#x438;. &#x41f;&#x440;&#x438; &#x430;&#x43d;&#x430;&#x43b;&#x438;&#x437;&#x435; &#x43f;&#x43e;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x432; &#x44d;&#x442;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e; &#x43e;&#x431;&#x440;&#x430;&#x449;&#x430;&#x442;&#x44c; &#x432;&#x43d;&#x438;&#x43c;&#x430;&#x43d;&#x438;&#x435; &#x43d;&#x430; &#x434;&#x432;&#x430; &#x444;&#x430;&#x43a;&#x442;&#x43e;&#x440;&#x430; - &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e; &#x43f;&#x43e;&#x442;&#x435;&#x440;&#x44c; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x435; &#x441;&#x431;&#x43e;&#x44f; &#x438; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x441;&#x431;&#x43e;&#x435;&#x43c; &#x438; &#x43f;&#x440;&#x43e;&#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x43d;&#x43e;&#x440;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;. (<u>&#x421;&#x438;&#x43d;&#x438;&#x446;&#x44b;&#x43d; &#x438; &#x434;&#x440;.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Локализации" ID="ID_471985301" CREATED="1389015245838" MODIFIED="1389646195836"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; (localization testing)</b>&#xa0;- &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x430;&#x434;&#x430;&#x43f;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x43d;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x435;&#x441;&#x442;&#x430; &#x44d;&#x43a;&#x441;&#x43f;&#x43b;&#x443;&#x430;&#x442;&#x430;&#x446;&#x438;&#x438;; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x435;&#x442; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x443; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x44f;&#x437;&#x44b;&#x43a;&#x430; &#x438; &#x43a;&#x443;&#x43b;&#x44c;&#x442;&#x443;&#x440;&#x43d;&#x43e;&#x439; &#x430;&#x434;&#x430;&#x43f;&#x442;&#x430;&#x446;&#x438;&#x438;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x41f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x430;&#x434;&#x430;&#x43f;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x43d;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x435;&#x441;&#x442;&#x430; &#x44d;&#x43a;&#x441;&#x43f;&#x43b;&#x443;&#x430;&#x442;&#x430;&#x446;&#x438;&#x438;; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x435;&#x442; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x443; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x44f;&#x437;&#x44b;&#x43a;&#x430; &#x438; &#x43a;&#x443;&#x43b;&#x44c;&#x442;&#x443;&#x440;&#x43d;&#x43e;&#x439; &#x430;&#x434;&#x430;&#x43f;&#x442;&#x430;&#x446;&#x438;&#x438;. (<u>&#x41a;&#x430;&#x43d;&#x435;&#x440; &#x438; &#x434;&#x440;.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Производительности" ID="ID_362912536" CREATED="1389015253390" MODIFIED="1661002635616" HGAP_QUANTITY="11 pt" VSHIFT_QUANTITY="-24 pt"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование производительности (performance testing)</b>&nbsp;&nbsp;- определение степени, с которой система выполняет заложенные в нее функции в установленных рамках на время обработки и пропускную способность.
    </p>
    <p>
      Достаточно часто при тестировании производительности проверяется сразу несколько его подвидов.
    </p>
    <p>
      В общем случае, при измерении только времени выполнения каких-либо операций, часто называется тестированием быстродействия.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Определение степени, с которой система выполняет заложенные в нее функции в установленных рамках на время обработки и пропускную способность. (<u>ISTQB</u>)
      </li>
      <li>
        Тестирование производительности позволяет выявлять узкие места в системе, которые проявляются в условиях повышенной нагрузки или нехватки системных ресурсов. (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
<node TEXT="Нагрузочное" ID="ID_1943745243" CREATED="1389015261333" MODIFIED="1660839209471"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Нагрузочное тестирование (load testing)</b>&nbsp;&nbsp;- выполнение программы c повышением нагрузки, вплоть до достижения запланированных характеристик, и далее с отслеживанием поведения на всем протяжении повышения загрузки системы.
    </p>
    <p>
      При этом может происходить, например:
    </p>
    <ul>
      <li>
        измерение времени выполнения выбранных операций при определенных интенсивностях выполнения этих операций;
      </li>
      <li>
        определение количества пользователей, одновременно работающих с приложением;
      </li>
      <li>
        определение границ приемлемой производительности при увеличении нагрузки (при увеличении интенсивности выполнения этих операций).
      </li>
    </ul>
    <p>
      <img src="img/d26d5078591b41139a89efd1f3399bd2.png"/>
      
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование реакции программы на предельные условия эксплуатации. (<u>Канер и др.</u>)
      </li>
      <li>
        Тип тестирования производительности, проводимый с целью оценки поведения системы при возрастающей нагрузке, например количестве параллельных пользователей и/или операций, а также определения какую нагрузку может выдержать компонент или система. (<u>ISTQB</u>)
      </li>
      <li>
        Выполнение системой программы c повышением нагрузки, вплоть до достижения запланированных характеристик и далее, с отслеживанием поведения на всем протяжении повышения загрузки системы. (<u>SWEBOK</u>)
      </li>
      <li>
        Автоматизированное тестирование, имитирующее работу определенного количества бизнес пользователей на каком либо общем (разделяемом ими) ресурсе. Задачей тестирования является определение масштабируемости приложения под нагрузкой, при этом происходит:

        <ul>
          <li>
            измерение времени выполнения выбранных операций при определенных интенсивностях выполнения этих операций;
          </li>
          <li>
            определение количества пользователей, одновременно работающих с приложением;
          </li>
          <li>
            определение границ приемлемой производительности при увеличении нагрузки (при увеличении интенсивности выполнения этих операций);
          </li>
          <li>
            исследование производительности на высоких, предельных, стрессовых нагрузках. (<u>Про Тестинг</u>)
          </li>
        </ul>
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Стабильности" ID="ID_348706550" CREATED="1389015269190" MODIFIED="1660839091426"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование стабильности (stability testing)</b>&nbsp;&nbsp;- проверка работоспособности приложения при длительном (многочасовом) тестировании со средним уровнем нагрузки. Времена выполнения операций могут играть в данном виде тестирования второстепенную роль. При этом на первое место выходит отсутствие утечек памяти, перезапусков серверов под нагрузкой и т.д.
    </p>
    <p>
      <img src="img/b24c1b5efb714cedb2464c11eec1efde.png"/>
      
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Задачей тестирования стабильности (надежности) является проверка работоспособности приложения при длительном (многочасовом) тестировании со средним уровнем нагрузки. Времена выполнения операций могут играть в данном виде тестирования второстепенную роль. При этом на первое место выходит отсутствие утечек памяти, перезапусков серверов под нагрузкой и другие аспекты, влияющие именно на стабильность работы. (<u>Про Тестинг</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Стрессовое" ID="ID_1565989269" CREATED="1389015277303" MODIFIED="1660839040647"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Стрессовое тестирование (stress testing)</b>&nbsp;&nbsp;- тестирование, оценивающее систему на граничных значениях рабочих нагрузок или за их пределами, или же в состоянии ограниченных ресурсов, таких как память или доступ к серверу.
    </p>
    <p>
      <img src="img/37539949bc82429aac47ea7ea14ddd98.png"/>
      
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Вид тестирования производительности, оценивающий систему на граничных значениях рабочих нагрузок или за их пределами, или же в состоянии ограниченных ресурсов, таких как память или доступ к серверу. (<u>ISTQB</u>)
      </li>
      <li>
        Оценка надежности и устойчивости системы в условиях превышения пределов нормального функционирования. (<u>Криспин и др.</u>)
      </li>
      <li>
        Оценка производительности и устойчивости системы в случае, когда для своей работы она выделяет максимально доступное количество ресурсов либо когда она работает в условиях их критической нехватки. Основная цель стрессового тестирования - вывести систему из строя, определить те условия, при которых она не сможет далее нормально функционировать. (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Объёмное" ID="ID_380852406" CREATED="1389015287780" MODIFIED="1389649885085"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x41e;&#x431;&#x44a;&#x435;&#x43c;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (volume testing)</b>&#xa0;- &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x43e;&#x435; &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x438; &#x443;&#x432;&#x435;&#x43b;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x438; &#x43e;&#x431;&#x44a;&#x435;&#x43c;&#x43e;&#x432; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43f;&#x440;&#x438; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x43c; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x438;&#x441;&#x43f;&#x44b;&#x442;&#x44b;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43d;&#x430; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x445; &#x43e;&#x431;&#x44a;&#x435;&#x43c;&#x430;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;. (<u>ISTQB</u>)
      </li>
      <li>
        &#x417;&#x430;&#x434;&#x430;&#x447;&#x435;&#x439; &#x43e;&#x431;&#x44a;&#x435;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x435;&#x43d;&#x438;&#x435; &#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x438; &#x443;&#x432;&#x435;&#x43b;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x438; &#x43e;&#x431;&#x44a;&#x435;&#x43c;&#x43e;&#x432; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x432; &#x431;&#x430;&#x437;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f;, &#x43f;&#x440;&#x438; &#x44d;&#x442;&#x43e;&#x43c; &#x43f;&#x440;&#x43e;&#x438;&#x441;&#x445;&#x43e;&#x434;&#x438;&#x442;:

        <ul>
          <li>
            &#x438;&#x437;&#x43c;&#x435;&#x440;&#x435;&#x43d;&#x438;&#x435; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x432;&#x44b;&#x431;&#x440;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x439; &#x43f;&#x440;&#x438; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x445; &#x438;&#x43d;&#x442;&#x435;&#x43d;&#x441;&#x438;&#x432;&#x43d;&#x43e;&#x441;&#x442;&#x44f;&#x445; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x44d;&#x442;&#x438;&#x445; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x439;;
          </li>
          <li>
            &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x435;&#x439;, &#x43e;&#x434;&#x43d;&#x43e;&#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x449;&#x438;&#x445; &#x441; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c;. (<u>&#x41f;&#x440;&#x43e; &#x422;&#x435;&#x441;&#x442;&#x438;&#x43d;&#x433;</u>)
          </li>
        </ul>
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Масштабируемости" ID="ID_535632301" CREATED="1389015297198" MODIFIED="1660839358646"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование&nbsp;&nbsp;масштабируемости (scalability testing)</b>&nbsp;&nbsp;- тестирование программного обеспечения для измерения возможностей вертикального и горизонтального масштабирования с точки зрения любой из нефункциональных возможностей будь то поддерживаемая пользовательская нагрузка, количество транзакций, объемы данных и т.д.
    </p>
    <p>
      
    </p>
    <p>
      <i><b>Вертикальное масштабирование</b></i>&nbsp;&nbsp;- увеличения производительности каждого компонента системы c целью повышения общей производительности.
    </p>
    <p>
      <i><b>Горизонтальное масштабирование</b></i>&nbsp;&nbsp;- разбиение системы на более мелкие структурные компоненты и разнесение их по отдельным физическим машинам и/или увеличение количества серверов параллельно выполняющих одну и ту же функцию.
    </p>
  </body>
</html></richcontent>
</node>
</node>
</node>
<node TEXT="Функциональное" ID="ID_229777236" CREATED="1389015118135" MODIFIED="1660836772825" HGAP_QUANTITY="28.25 pt" VSHIFT_QUANTITY="0.75 pt"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Функциональное тестирование (functional testing)</b>&nbsp;- тестирование программного обеспечения (как правило, методом черного ящика) в целях проверки реализуемости функциональных требований и на соответствие технологической документации или спецификации.
    </p>
    <p>
      К функциональному тестированию относится большая часть работ, выполняемых отделом тестирования.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование, основанное на анализе спецификации функциональности компонента или системы. (<b>ISTQB</b>)
      </li>
      <li>
        Проверка соответствия системы, предъявляемым к ней требованиям, описанным на уровне спецификации поведенческих характеристик. (<b>SWEBOK</b>)
      </li>
      <li>
        Тестирование программного обеспечения в целях проверки реализуемости функциональных требований, то есть способности ПО в определённых условиях решать задачи, нужные пользователям. (<b>Криспин и др.</b>)
      </li>
      <li>
        Тестирование методом черного ящика, в котором тесты основываются на спецификации компонент программного обеспечения. Функции тестируются с помощью передачи входных данных и исследования выходных данных. Внутренне устройство программы при этом редко принимается во внимание (в отличие от тестирования методов белого ящика). Функциональное тестирование отличается от системного тем, что верифицирует программу на соответствие технологической документации или спецификации; в то время как системное тестирования производит валидацию программы на соответствие известным требованиям к системе. (<b>Канер и др.</b>)
      </li>
      <li>
        Данный вид тестирования предназначен для доказательства того, что вся система в целом ведет себя в соответствии с ожиданиями пользователя, формализованными в виде требований к системе. В ходе данного вида тестирования проверяются все функции системы с точки зрения ее пользователей (как пользователей-людей, так и «пользователей» - других программных систем). Система при функциональном тестировании рассматривается как черный ящик. (<b>Синицын и др.</b>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Безопасноcти" ID="ID_1845434140" CREATED="1389015198315" MODIFIED="1661004154171" HGAP_QUANTITY="28.25 pt" VSHIFT_QUANTITY="-12 pt"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование безопасноcти/защищённости (security testing)</b>&nbsp;&nbsp;– тестирование программного продукта с целью определить его защищённость. Основные понятия, которые должны быть охвачены тестированием: конфиденциальность, целостность и сохранность данных, аутентификация, авторизация и невозможность отказа от авторства.
    </p>
    <p>
      Проводится для тех объектов, в работе которых обеспечение защищёности является одной из важнейших задач.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование программного продукта с целью определить его безопасность. (<u>ISTQB</u>)
      </li>
      <li>
        Процесс определения того, обеспечивает ли информационная система сохранность данных и поддерживает ли функциональность на заявленном уровне. Шесть основных понятий безопасности, которые должны быть охвачены тестированием безопасности: конфиденциальность, целостность и сохранность данных, аутентификация, бесперебойность работы, авторизация и невозможность отказа от авторства. (<u>NIAG</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
</node>
<node TEXT="По хронологии выполнения" POSITION="left" ID="ID_1396061043" CREATED="1389014942906" MODIFIED="1389014951629">
<node TEXT="Комплексное" ID="ID_1835742230" CREATED="1389015323711" MODIFIED="1661001097893"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Комплексное тестирование (complex testing)</b>&nbsp;&nbsp;- вид внутреннего тестирования продукта на соответствие установленным требованиям перед выпуском версии для тестирования. Особое внимание на этом этапе тестирования уделяется проверке взаимодействия модулей между собой.
    </p>
    <p>
      Комплексное тестирование выполняется разработчиками согласно специальному плану тестирования.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Вид внутреннего тестирования продукта на соответствие установленным требованиям перед выпуском версии для тестирования. На этом этапе еще не все может быть реализовано полностью, однако основная функциональность уже должна быть. Особое внимание на этом этапе тестирования уделяется проверке взаимодействия модулей между собой. Комплексное тестирование выполняется разработчиками согласно специальному плану тестирования. (<u>НПО Компьютер</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Дымовое" ID="ID_1302671915" CREATED="1389015335039" MODIFIED="1661003096314"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Дымовое/входное тестировние (smoke/intake test)</b>&nbsp;- специальный тест (короткий цикл тестов) для принятия решения, готов ли компонент или система для дальнейшего детального тестирования. Выполняется для подтверждения того, что после сборки кода (нового или исправленного) приложение, стартует и выполняет основные функции.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Специальный тип <u><b>теста на «дым»</b></u>&nbsp;для принятия решения, готов ли компонент или система для дальнейшего детального тестирования. Обычно проводится в начала фазы тестирования. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Основное" ID="ID_645768963" CREATED="1389015340184" MODIFIED="1389650326380"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x41e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;</b>&#xa0; - &#x43f;&#x435;&#x440;&#x432;&#x44b;&#x439; &#x43a;&#x440;&#x443;&#x433; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x432;&#x441;&#x435;&#x445; &#x437;&#x430;&#x43f;&#x43b;&#x430;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43e;&#x43a; &#x434;&#x43b;&#x44f; &#x43d;&#x43e;&#x432;&#x43e;&#x439; &#x438;/&#x438;&#x43b;&#x438; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x43d;&#x43e;&#x439; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438;.
    </p>
    <p>
      &#x41e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x43e;&#x442; &#x446;&#x435;&#x43b;&#x435;&#x439;, &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x441;&#x43e;&#x432;&#x43c;&#x435;&#x449;&#x430;&#x442;&#x44c; &#x432; &#x441;&#x435;&#x431;&#x435; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; &#x438; &#x443;&#x434;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x438;&#x43b;&#x438; &#x431;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;&#x441;&#x442;&#x438;; &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x43e;&#x442; &#xab;&#x433;&#x43b;&#x443;&#x431;&#x438;&#x43d;&#x44b;&#xbb; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43e;&#x43a; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x441;&#x43e;&#x431;&#x43e;&#x439; &#x44d;&#x43a;&#x441;&#x43f;&#x440;&#x435;&#x441;&#x441;-&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438;&#x43b;&#x438; &#x441;&#x430;&#x43d;&#x438;&#x442;&#x430;&#x440;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438; &#x442;.&#x434;.
    </p>
  </body>
</html></richcontent>
</node>
<node TEXT="Повторное" ID="ID_535116455" CREATED="1389015348028" MODIFIED="1389650366700"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x41f;&#x43e;&#x432;&#x442;&#x43e;&#x440;&#x43d;&#x43e;&#x435;/&#x41f;&#x43e;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x44e;&#x449;&#x435;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (re-testing/confirmation testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x432;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x44e;&#x442;&#x441;&#x44f; &#x442;&#x435;&#x441;&#x442;&#x43e;&#x432;&#x44b;&#x435; &#x441;&#x446;&#x435;&#x43d;&#x430;&#x440;&#x438;&#x438;, &#x432;&#x44b;&#x44f;&#x432;&#x438;&#x432;&#x448;&#x438;&#x435; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x438; &#x432;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x433;&#x43e; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430;, &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x438;&#x441;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x44d;&#x442;&#x438;&#x445; &#x43e;&#x448;&#x438;&#x431;&#x43e;&#x43a;.
    </p>
    <p>
      &#x41f;&#x43e;&#x432;&#x442;&#x43e;&#x440;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x43e;&#x431;&#x44f;&#x437;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x43c; &#x44d;&#x442;&#x430;&#x43f;&#x43e;&#x43c; &#x43f;&#x440;&#x430;&#x43a;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x432;&#x43e; &#x432;&#x441;&#x435;&#x445; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x445; &#x43f;&#x43e; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44e; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x442;&#x43e;&#x432; &#x438;, &#x43a;&#x430;&#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x43e;, &#x441;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43a; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x435; &#x438;&#x441;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x437;&#x430;&#x43c;&#x435;&#x447;&#x430;&#x43d;&#x438;&#x439;, &#x43e;&#x444;&#x43e;&#x440;&#x43c;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x445; &#x43d;&#x430; &#x44d;&#x442;&#x430;&#x43f;&#x435; <u><b>&#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x433;&#x43e; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;</b></u>.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x432;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x44e;&#x442;&#x441;&#x44f; &#x442;&#x435;&#x441;&#x442;&#x43e;&#x432;&#x44b;&#x435; &#x441;&#x446;&#x435;&#x43d;&#x430;&#x440;&#x438;&#x438;, &#x432;&#x44b;&#x44f;&#x432;&#x438;&#x432;&#x448;&#x438;&#x435; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x438; &#x432;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x433;&#x43e; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430;, &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x438;&#x441;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x44d;&#x442;&#x438;&#x445; &#x43e;&#x448;&#x438;&#x431;&#x43e;&#x43a;. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Регрессионное" ID="ID_60992721" CREATED="1389015352001" MODIFIED="1661001138086"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Регрессионное тестирование (regression testing)</b>&nbsp;&nbsp;- тестирование уже протестированной программы после модификации для уверенности в том, что процесс модификации не внес или не активизировал ошибки в областях, не подвергавшихся изменениям. Проводится после изменений в коде программного продукта или его окружения.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование уже протестированной программы после модификации для уверенности в том, что процесс модификации не внес или не активизировал ошибки в областях, не подвергавшихся изменениям. Проводится после изменений в коде программного продукта или его окружения. (<u>ISTQB</u>)
      </li>
      <li>
        Цикл тестирования, который производится при внесении изменений на фазе системного тестирования или сопровождения продукта. (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
</node>
<node TEXT="По степени автоматизации" POSITION="right" ID="ID_291763218" CREATED="1389014961094" MODIFIED="1389014969475">
<node TEXT="Ручное" ID="ID_1514596020" CREATED="1389015414857" MODIFIED="1660835654212"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Ручное тестирование (manual testing)</b>&nbsp;&nbsp;- выполнение тестовых процедур без использования каких-либо средств автоматизации.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Выполнение тестовых процедур без использования каких-либо средств автоматизации. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Автоматизированное" ID="ID_181738531" CREATED="1389015417548" MODIFIED="1660836820155"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Автоматизированное тестирование (semiautomated testing)</b>&nbsp;&nbsp;- ручное тестирование с использованием средств автоматизации, например, для генерации тестовых данных или сбора, хранения, анализа результатов и др.
    </p>
    <p>
      Примеры:
    </p>
    <ol>
      <li>
        Скрипты для генерации тестовых данных (заполнение базы записями справочников, документами, задачами, пользователями, создание документов заданного размера и т.д.).
      </li>
      <li>
        Утилиты отслеживания логов.
      </li>
    </ol>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Ручное тестирование с использованием средств автоматизации, например, для сбора, хранения, анализа результатов и др. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Автоматическое" ID="ID_908979378" CREATED="1389015425035" MODIFIED="1660836805645"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Автоматическое тестирование (automated testing)</b>&nbsp;&nbsp;- использование программного обеспечения для осуществления или помощи в проведении определенных тестовых процедур, например, управление тестированием, проектирование тестов, выполнение тестов и проверка результатов.
    </p>
    <p>
      Примеры:
    </p>
    <ol>
      <li>
        Практически все тесты производительности.
      </li>
      <li>
        Автоматические функциональные тесты.
      </li>
      <li>
        И т.д.
      </li>
    </ol>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Использование программного обеспечения для осуществления или помощи в проведении определенных тестовых процессов, например, управление тестированием, проектирование тестов, выполнение тестов и проверка результатов. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="По формальности" POSITION="left" ID="ID_483552114" CREATED="1389014974853" MODIFIED="1389014979242">
<node TEXT="По сценариям" ID="ID_393889758" CREATED="1389015456923" MODIFIED="1660835751142"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование по сценариям (scripted testing)</b>&nbsp;&nbsp;– тестирование по заранее составленным и задокументированным тестовым сценариям.
    </p>
    <p>
      К данному виду относится большая часть деятельности отдела тестирования.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование по заранее составленным и задокументированным тестам. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Исследовательское" ID="ID_862133477" CREATED="1389015463189" MODIFIED="1660836855039"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Исследовательское тестирование (exploratory testing)</b>&nbsp;&nbsp;- неформальный метод, при котором тестировщик активно контролирует проектирование тестов, в то время как эти тесты выполняются, и использует полученную информацию для проектирования новых улучшенных тестов. Такое тестирование определяется как одновременное обучение, проектирование теста и его исполнение.
    </p>
    <p>
      Пример:
    </p>
    <ol>
      <li>
        Тестирование, при котором строится карта приложения (mind-карта или таблица в документе отражающая проверенный функционал), в ходе тестирования оформляются замечания, по завершении оформляется отчёт. Изначально тестов для приложения нет.
      </li>
    </ol>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Неформальный метод, при котором тестировщик активно контролирует проектирование тестов, в то время как эти тесты выполняются, и использует полученную информацию для проектирования новых улучшенных тестов. Такое тестирование определяется как одновременное обучение, проектирование теста и его исполнение. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Специализированное (свободное)" ID="ID_1047323144" CREATED="1389015472530" MODIFIED="1660831341856"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Специализированное (свободное) тестирование (ad hoc testing)</b>&nbsp;&nbsp;- техника тестирования, основывающаяся на опыте, интуиции и знаниях инженера, рассматривающего проблему с точки зрения имевшихся ранее аналогий. Тестирование, выполняемое неформально: без формальной подготовки тестов, формальных методов проектирования тестов, определения ожидаемых результатов и руководства по выполнению тестирования.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Техника тестирования, основывающаяся на опыте, интуиции и знаниях инженера, рассматривающего проблему с точки зрения имевшихся ранее аналогий.
      </li>
      <li>
        Тестирование, выполняемое неформально; без формальной подготовки тестов, формальных методов проектирования тестов, определения ожидаемых результатов и руководства по выполнению тестирования. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="По позитивности сценария" POSITION="right" ID="ID_1934217318" CREATED="1389014993157" MODIFIED="1389015001105">
<node TEXT="Позитивное" ID="ID_1909484233" CREATED="1389015517563" MODIFIED="1389652019388"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x41f;&#x43e;&#x437;&#x438;&#x442;&#x438;&#x432;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (positive testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43a;&#x43e;&#x440;&#x440;&#x435;&#x43a;&#x442;&#x43d;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x43e; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x442; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x438;.
    </p>
    <p>
      &#x41a;&#x430;&#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x43e;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x432; &#x43f;&#x435;&#x440;&#x432;&#x443;&#x44e; &#x43e;&#x447;&#x435;&#x440;&#x435;&#x434;&#x44c;, &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x438;&#x43d;&#x446;&#x438;&#x43f;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43e;&#x431;&#x44a;&#x435;&#x43a;&#x442;&#x430; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43a;&#x43e;&#x440;&#x440;&#x435;&#x43a;&#x442;&#x43d;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x442;&#x43e;&#x433;&#x43e;, &#x447;&#x442;&#x43e; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x43e; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x442; &#x432;&#x44b;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x438;. (<u>&#x41f;&#x440;&#x43e; &#x422;&#x435;&#x441;&#x442;&#x438;&#x43d;&#x433;</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Негативное" ID="ID_34706534" CREATED="1389015521368" MODIFIED="1389652082900"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x41d;&#x435;&#x433;&#x430;&#x442;&#x438;&#x432;&#x43d;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (negative testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x43a;&#x430;&#x43a; &#x43a;&#x43e;&#x440;&#x440;&#x435;&#x43a;&#x442;&#x43d;&#x44b;&#x445;, &#x442;&#x430;&#x43a; &#x438; &#x43d;&#x435;&#x43a;&#x43e;&#x440;&#x440;&#x435;&#x43a;&#x442;&#x43d;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x441; &#x446;&#x435;&#x43b;&#x44c;&#x44e; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x438; &#x438;&#x441;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x439;.
    </p>
    <p>
      &#x41a;&#x430;&#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x43e;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x43f;&#x43e;&#x437;&#x438;&#x442;&#x438;&#x432;&#x43d;&#x43e;&#x433;&#x43e; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;. &#x412; &#x443;&#x441;&#x43b;&#x43e;&#x432;&#x438;&#x44f;&#x445; &#x436;&#x435;&#x441;&#x442;&#x43a;&#x438;&#x445; &#x43e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x439; &#x43f;&#x43e; &#x441;&#x440;&#x43e;&#x43a;&#x430;&#x43c; &#x434;&#x43e;&#x441;&#x442;&#x430;&#x442;&#x43e;&#x447;&#x43d;&#x43e; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x432;&#x44b;&#x441;&#x442;&#x443;&#x43f;&#x430;&#x435;&#x442; &#x432; &#x440;&#x43e;&#x43b;&#x438; &#x431;&#x430;&#x43b;&#x43b;&#x430;&#x441;&#x442;&#x430;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x439; &#x432; &#x446;&#x435;&#x43b;&#x44f;&#x445; &#x44d;&#x43a;&#x43e;&#x43d;&#x43e;&#x43c;&#x438;&#x438; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43e;&#x442;&#x431;&#x440;&#x430;&#x441;&#x44b;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x438; &#x43d;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x43a;&#x430;&#x43a; &#x43a;&#x43e;&#x440;&#x440;&#x435;&#x43a;&#x442;&#x43d;&#x44b;&#x445;, &#x442;&#x430;&#x43a; &#x438; &#x43d;&#x435;&#x43a;&#x43e;&#x440;&#x440;&#x435;&#x43a;&#x442;&#x43d;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x441; &#x446;&#x435;&#x43b;&#x44c;&#x44e; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x438; &#x438;&#x441;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x439;. (<u>&#x41f;&#x440;&#x43e; &#x422;&#x435;&#x441;&#x442;&#x438;&#x43d;&#x433;</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="По исполнению кода" POSITION="left" ID="ID_1257126120" CREATED="1389015008723" MODIFIED="1389015014124">
<node TEXT="Статическое" ID="ID_1969638000" CREATED="1389015540255" MODIFIED="1389652903603"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x421;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (static testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43d;&#x430; &#x443;&#x440;&#x43e;&#x432;&#x43d;&#x435; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438; &#x438;&#x43b;&#x438; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x431;&#x435;&#x437; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x43a;&#x43e;&#x434;&#x430; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x442;&#x430;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x43d;&#x430; &#x443;&#x440;&#x43e;&#x432;&#x43d;&#x435; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438; &#x438;&#x43b;&#x438; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x431;&#x435;&#x437; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x43a;&#x43e;&#x434;&#x430; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x442;&#x430;. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
<node TEXT="Статический анализ кода" ID="ID_1832030445" CREATED="1389015553494" MODIFIED="1389697399742"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x421;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x439; &#x430;&#x43d;&#x430;&#x43b;&#x438;&#x437; &#x43a;&#x43e;&#x434;&#x430; (static code analysis)</b>&#xa0; - &#x430;&#x43d;&#x430;&#x43b;&#x438;&#x437; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430;, &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x44b;&#x439; &#x431;&#x435;&#x437; &#x435;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f;. &#x422;&#x438;&#x43f;&#x438;&#x447;&#x43d;&#x44b;&#x435; &#x434;&#x435;&#x444;&#x435;&#x43a;&#x442;&#x44b; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x430;&#x43d;&#x430;&#x43b;&#x438;&#x437;&#x430;:
    </p>
    <ul>
      <li>
        &#x441;&#x441;&#x44b;&#x43b;&#x43a;&#x430; &#x43d;&#x430; &#x43f;&#x435;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x443;&#x44e; &#x441; &#x43d;&#x435;&#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x438;&#x435;&#x43c;;
      </li>
      <li>
        &#x43f;&#x435;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x44b;&#x435;, &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x43d;&#x438;&#x43a;&#x43e;&#x433;&#x434;&#x430; &#x43d;&#x435; &#x431;&#x44b;&#x43b;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x44b;;
      </li>
      <li>
        &#x43d;&#x438;&#x43a;&#x43e;&#x433;&#x434;&#x430; &#x43d;&#x435; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x43c;&#x44b;&#x439; &#x43a;&#x43e;&#x434;;
      </li>
      <li>
        &#x43d;&#x430;&#x440;&#x443;&#x448;&#x435;&#x43d;&#x438;&#x435; &#x441;&#x442;&#x430;&#x43d;&#x434;&#x430;&#x440;&#x442;&#x43e;&#x432; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x438; &#x442;.&#x434;.
      </li>
    </ul>
    <p>
      &#x412; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x43c; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x410;&#x43d;&#x430;&#x43b;&#x438;&#x437; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430;, &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x44b;&#x439; &#x431;&#x435;&#x437; &#x435;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f;. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Рецензирование исходного кода" ID="ID_1595538490" CREATED="1389015563379" MODIFIED="1389697519773"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x420;&#x435;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430; (code review)</b>&#xa0; - &#x432;&#x438;&#x434; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;, &#x437;&#x430;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44e;&#x449;&#x438;&#x439;&#x441;&#x44f; &#x432; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x435; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438; (&#x442;.&#x435;. &#x43d;&#x435; &#x43f;&#x443;&#x442;&#x435;&#x43c; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x438; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430;, &#x430; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x432;&#x43d;&#x443;&#x442;&#x440;&#x435;&#x43d;&#x43d;&#x435;&#x439; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430;).
    </p>
    <p>
      &#x412;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x447;&#x438;&#x43a;&#x430;&#x43c;&#x438;, &#x43d;&#x435; &#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x432;&#x448;&#x438;&#x43c;&#x438; &#x443;&#x447;&#x430;&#x441;&#x442;&#x438;&#x44f; &#x432; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x435; (&#x43c;&#x43e;&#x434;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438;) &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x412;&#x438;&#x434; &#x432;&#x43d;&#x443;&#x442;&#x440;&#x435;&#x43d;&#x43d;&#x435;&#x433;&#x43e; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;, &#x437;&#x430;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44e;&#x449;&#x438;&#x439;&#x441;&#x44f; &#x432; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x435; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x43e;&#x432; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438; (&#x442;.&#x435;. &#x43d;&#x435; &#x43f;&#x443;&#x442;&#x435;&#x43c; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x438; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430;, &#x430; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x432;&#x43d;&#x443;&#x442;&#x440;&#x435;&#x43d;&#x43d;&#x435;&#x439; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430;). &#x412;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x447;&#x438;&#x43a;&#x430;&#x43c;&#x438;, &#x43d;&#x435; &#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x432;&#x448;&#x438;&#x43c;&#x438; &#x443;&#x447;&#x430;&#x441;&#x442;&#x438;&#x44f; &#x432; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x435; (&#x43c;&#x43e;&#x434;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438;) &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x44d;&#x43b;&#x435;&#x43c;&#x435;&#x43d;&#x442;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438;. (<u>&#x41d;&#x41f;&#x41e; &#x41a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="Динамическое" ID="ID_40245200" CREATED="1389015548146" MODIFIED="1389697634702"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>&#x414;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x435; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; (dynamic testing)</b>&#xa0; - &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x43e;&#x435; &#x432;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;, &#x43a;&#x43e;&#x43c;&#x43f;&#x43e;&#x43d;&#x435;&#x43d;&#x442;&#x430; &#x438;&#x43b;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;.
    </p>
    <p>
      &#x41a; &#x434;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x43c;&#x443; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44e;, &#x432; &#x43d;&#x430;&#x441;&#x442;&#x43e;&#x44f;&#x449;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43c;&#x44f;, &#x43e;&#x442;&#x43d;&#x43e;&#x441;&#x438;&#x442;&#x441;&#x44f; &#x432;&#x441;&#x44f; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x43e;&#x442;&#x434;&#x435;&#x43b;&#x430; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;.
    </p>
    <p>
      
    </p>
    <p>
      <u>&#x412;&#x430;&#x440;&#x438;&#x430;&#x43d;&#x442;&#x44b; &#x43e;&#x43f;&#x440;&#x435;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x437; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;</u>:
    </p>
    <ol>
      <li>
        &#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x43e;&#x435; &#x432;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x432;&#x44b;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;, &#x43a;&#x43e;&#x43c;&#x43f;&#x43e;&#x43d;&#x435;&#x43d;&#x442;&#x430; &#x438;&#x43b;&#x438; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;. (<u>ISTQB</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="По знанию системы" POSITION="right" ID="ID_336425656" CREATED="1389015019249" MODIFIED="1389015024084">
<node TEXT="Белого ящика" ID="ID_1555087014" CREATED="1389031506261" MODIFIED="1661002393338"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование белого ящика (white box testing)</b>&nbsp;&nbsp;- тестирование, основанное на анализе внутренней структуры компонента или системы и на знании исходного кода, к которому тестировщик (как правило, это программист) имеет полный доступ.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование, основанное на анализе внутренней структуры компонента или системы. (<u>ISTQB</u>)
      </li>
      <li>
        Тестировщик (как правило, это программист) разрабатывает тесты, основываясь на знании исходного кода, к которому он имеет полный доступ. (<u>Канер и др.</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Серого ящика" ID="ID_1206754111" CREATED="1389031514749" MODIFIED="1661002406340"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование серого ящика (gray box testing)</b>&nbsp;&nbsp;- тестирование, ориентированное на имитацию работы пользователей, в условиях, когда часть внутренней структуры программы известна.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источнико</u>в:
    </p>
    <ol>
      <li>
        Тестирование, ориентированное на имитацию работы пользователей, в условиях, когда часть внутренней структуры программы известна.
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Чёрного ящика" ID="ID_1911937723" CREATED="1389031519228" MODIFIED="1661002582685"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование чёрного ящика (black box testing)</b>&nbsp;&nbsp;- тестирование, основанное на анализе функциональной или нефункциональной спецификации системы, при котором программа рассматривается как объект, внутренняя структура которого неизвестна.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование, основанное на анализе функциональной или нефункциональной спецификации системы без знания внутренней структуры. (<u>ISTQB</u>)
      </li>
      <li>
        Тестирование, при котором программа рассматривается как объект, внутренняя структура которого неизвестна. (<u>Канер и др.</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
</node>
<node TEXT="По уровню тестирования" POSITION="left" ID="ID_572069095" CREATED="1389015031305" MODIFIED="1661003781121">
<node TEXT="Модульное (компонентное)" ID="ID_1264161001" CREATED="1389031549523" MODIFIED="1661003865945"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Модульное/компонентное тестирование (unit/component testing)</b>&nbsp;&nbsp;- тестирование наименьших элементов программного обеспечения, которые могут быть протестированы по-отдельности (модули, объекты, классы, функции). Задача модульного тестирования - выявление локализованных в модуле ошибок реализации алгоритмов, а также в определение степени готовности системы к переходу на следующий уровень разработки и тестирования.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование наименьших элементов программного обеспечения, которые могут быть протестированы по-отдельности (модули, объекты, классы, функции). (<u>ISTQB</u>)
      </li>
      <li>
        Тестирование программы на уровне отдельно взятых модулей, функций или классов. Цель модульного тестирования состоит в выявлении локализованных в модуле ошибок в реализации алгоритмов, а также в определении степени готовности системы к переходу на следующий уровень разработки и тестирования. Модульное тестирование проводится по принципу «белого ящика», то есть основывается на знании внутренней структуры программы, и часто включает те или иные методы анализа покрытия кода. (<u>Синицын и др.</u>)
      </li>
      <li>
        Компонентное (модульное) тестирование проверяет функциональность и ищет дефекты в частях приложения, которые доступны и могут быть протестированы по-отдельности (модули программ, объекты, классы, функции и т.д.). Обычно компонентное (модульное) тестирование проводится посредством вызова кода, который необходимо проверить и при поддержке сред разработки. (<u>Про Тестинг</u>)
      </li>
      <li>
        Этот уровень тестирования позволяет проверить функционирование отдельно взятого элемента системы. Что считать элементом – модулем системы определяется контекстом. (<u>SWEBOK</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Интеграционное" ID="ID_982494269" CREATED="1389031558222" MODIFIED="1661000444980"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Интеграционное тестирование (integration testing)</b>&nbsp;&nbsp;- тестирование части системы, состоящей из двух и более модулей. Задача интеграционного тестирования - поиск дефектов, связанных с ошибками реализации и интерпретации интерфейсного взаимодействия между модулями, а также ошибок взаимодействия с другими частями системы (операционной системой, оборудованием).
    </p>
    <p>
      Интеграционное тестирование в качестве входных данных использует модули, над которыми было проведено модульное тестирование, группирует их в более крупные множества и выполняет тесты, определенные для этих множеств.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование, выполняемое для обнаружения дефектов в интерфейсах и во взаимодействии между интегрированными компонентами или системами. (<u>ISTQB</u>)
      </li>
      <li>
        Тестирование части системы, состоящей из двух и более модулей. Основная задача интеграционного тестирования - поиск дефектов, связанных с ошибками в реализации и интерпретации интерфейсного взаимодействия между модулями. (<u>Синицын и др.</u>)
      </li>
      <li>
        Интеграционное тестирование предназначено для проверки связи между компонентами, а также взаимодействия с различными частями системы (операционной системой, оборудованием либо связи между различными системами). (<u>Про Тестинг</u>)
      </li>
      <li>
        Данный уровень тестирования является процессом проверки взаимодействия между программными компонентами/модулями. (<u>SWEBOK</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Системное" ID="ID_1489097051" CREATED="1389031566539" MODIFIED="1661003769177" HGAP_QUANTITY="20.75 pt" VSHIFT_QUANTITY="-1.5 pt"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Системное тестирование (system testing)</b>&nbsp;&nbsp;- процесс тестирования системы в целом с целью проверки того, что она соответствует установленным требованиям. Задача системного тестирования - выявление дефектов, связанных с работой системы в целом, таких как неверное использование ресурсов системы, непредусмотренные комбинации данных пользовательского уровня, несовместимость с окружением, непредусмотренные сценарии использования, отсутствующая или неверная функциональность, неудобство в применении и т.д.
    </p>
    <p>
      
    </p>
    <p>
      В системном тестировании тестовая среда должна максимально соответствовать рабочей среде выполнения. Тестирование, как правило, проводится на уровне пользовательских интерфейсов.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Процесс тестирования системы в целом с целью проверки того, что она соответствует установленным требованиям. (<u>ISTQB</u>)
      </li>
      <li>
        Основная задача системного тестирования - выявление дефектов, связанных с работой системы в целом, таких как неверное использование ресурсов системы, непредусмотренные комбинации данных пользовательского уровня, несовместимость с окружением, непредусмотренные сценарии использования, отсутствующая или неверная функциональность, неудобство в применении и тому подобное. (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html>
</richcontent>
</node>
<node TEXT="Приёмочное" ID="ID_47354664" CREATED="1389015360342" MODIFIED="1661003781121" HGAP_QUANTITY="13.25 pt" VSHIFT_QUANTITY="-0.75 pt"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Приёмочное тестирование (acceptance testing)</b>&nbsp;- формальный процесс тестирования, который проверяет соответствие системы потребностям, требованиям и бизнес процессам пользователя, и проводится для вынесения решения заказчиком (внутренним или внешним) или другим уполномоченным лицом принимается приложение или нет.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Формальное тестирование по отношению к потребностям, требованиям и бизнес процессам пользователя, проводимое с целью определения соответствия системы критериям приёмки. (<u>ISTQB</u>)
      </li>
      <li>
        Формальный процесс тестирования, который проверяет соответствие системы требованиям и проводится с целью:

        <ul>
          <li>
            определения удовлетворяет ли система приемочным критериям;
          </li>
          <li>
            вынесения решения заказчиком или другим уполномоченным лицом принимается приложение или нет. (<u>Про Тестинг</u>)
          </li>
        </ul>
      </li>
      <li>
        Фаза тестирования, характерная для программных систем, разрабатываемых на заказ. Как правило, заменяет этапы альфа- и бета- тестирования. (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="По разработке тестовых сценариев" POSITION="right" ID="ID_1088732628" CREATED="1389015052008" MODIFIED="1389015064274">
<node TEXT="На основе требований" ID="ID_325599631" CREATED="1389031613187" MODIFIED="1660944231609"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование на основе требований (requirements-based testing)</b>&nbsp;&nbsp;- подход к тестированию, при котором тестовые сценарии разрабатываются на основе целей и условий тестирования, вытекающих из требований. Так для каждого требования пишется один или несколько тестовых случаев, проверяющих выполнение данного требования.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Подход к тестированию, при котором тестовые сценарии разрабатываются на основе целей и условий тестирования, вытекающих из требований. (<u>ISTQB</u>)
      </li>
      <li>
        Для каждого требования пишутся тестовые случаи, проверяющие выполнение данного требования. (<u>Про Тестинг</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="По вариантам использования" ID="ID_1905205925" CREATED="1389031626725" MODIFIED="1660944255690"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование по вариантам использования (use case testing)</b>&nbsp;&nbsp;- подход к тестированию, при котором тестовые сценарии создаются для выполнения сценариев использования, написанных на основе представления о способах использования продукта.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Разработка тестов методом черного ящика, в котором тестовые сценарии создаются для выполнения сценариев использования. (<u>ISTQB</u>)
      </li>
      <li>
        На основе представления о способах использования продукта создаются варианты использования системы (use cases). По конкретному варианту использования можно определить один или более сценариев. На проверку каждого сценария пишутся тесты, которые должны быть проверены. (<u>Про Тестинг</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="На основе модели" ID="ID_280664844" CREATED="1389031634365" MODIFIED="1660944335692"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Тестирование на основе модели (model-based testing)</b>&nbsp;&nbsp;- тестирование программного обеспечения, в котором тесты частично или полностью получаются из модели, описывающей некоторые аспекты (чаще функциональные) тестируемой системы.
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Тестирование программного обеспечения, в котором тесты частично или полностью получаются из модели, описывающей некоторые аспекты (чаще функциональные) тестируемой системы.
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="По исполнителям тестирования" POSITION="left" ID="ID_1637831854" CREATED="1389015071484" MODIFIED="1660832624798">
<node TEXT="Альфа-тестирование" ID="ID_1116706495" CREATED="1389031657065" MODIFIED="1660834664551"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Альфа-тестирование (alpha testing)</b>&nbsp;&nbsp;- внутреннее пробное использование. Фаза тестирования характерная для программных систем общего применения (не разрабатываемых на заказ).
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Моделируемое или действительное эксплуатационное тестирование потенциальными пользователями/заказчиками или независимой командой тестирования на стороне разработчиков, но вне разрабатывающей организации.&nbsp;&nbsp;Альфа-тестирование&nbsp;&nbsp;часто&nbsp;&nbsp;применяется&nbsp;&nbsp;к&nbsp;&nbsp;готовому&nbsp;&nbsp;программному обеспечению в качестве внутреннего приёмочного тестирования. (<u>ISTQB</u>)
      </li>
      <li>
        Внутреннее пробное использование. (<u>SWEBOK</u>)
      </li>
      <li>
        Фаза тестирования, характерная для программных систем общего применения (не разрабатываемых на заказ). (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="Бета-тестирование" ID="ID_317729969" CREATED="1389031663031" MODIFIED="1660834625943"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      <b>Бета-тестирование (beta testing)</b>&nbsp;&nbsp;- пробное использование с привлечением отобранных внешних пользователей. Фаза тестирования характерная для программных систем общего применения (не разрабатываемых на заказ).
    </p>
    <p>
      
    </p>
    <p>
      <u>Варианты определения из разных источников</u>:
    </p>
    <ol>
      <li>
        Эксплуатационное&nbsp;&nbsp;тестирование&nbsp;&nbsp;потенциальными и/или существующими клиентами/заказчиками на внешней стороне никак не связанными с разработчиками, с целью определения действительно ли компонент или система удовлетворяет требованиям клиента/заказчика и вписывается в бизнес-процессы. Бета-тестирование часто проводится как форма внешнего приёмочного тестирования готового программного обеспечения для того чтобы получить отзывы рынка. (<u>ISTQB</u>)
      </li>
      <li>
        Пробное использование с привлечением отобранных внешних пользователей. (<u>SWEBOK</u>)
      </li>
      <li>
        Фаза тестирования, характерная для программных систем общего применения (не разрабатываемых на заказ). (<u>Синицын и др.</u>)
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="Источники" FOLDED="true" POSITION="right" ID="ID_1370795097" CREATED="1389032799917" MODIFIED="1389715649281">
<icon BUILTIN="list"/>
<node TEXT="Глоссарий ISTQB" ID="ID_1400603674" CREATED="1389032855340" MODIFIED="1389033248991"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      &#x421;&#x430;&#x43c;&#x44b;&#x439; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x439;, &#x43f;&#x43e;&#x43b;&#x43d;&#x44b;&#x439; &#x438;, &#x43f;&#x43e;&#x436;&#x430;&#x43b;&#x443;&#x439;, &#x441;&#x430;&#x43c;&#x44b;&#x439; &#x434;&#x43e;&#x441;&#x442;&#x43e;&#x432;&#x435;&#x440;&#x43d;&#x44b;&#x439; &#x433;&#x43b;&#x43e;&#x441;&#x441;&#x430;&#x440;&#x438;&#x439; &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d;&#x43e;&#x432; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;. &#x41f;&#x43e;&#x434;&#x433;&#x43e;&#x442;&#x43e;&#x432;&#x43b;&#x435;&#x43d; "Glossary Working Party" International Software Testing Qualifications Board.
    </p>
  </body>
</html></richcontent>
<node TEXT="ISTQB - Glossary 2.2 (RU)" ID="ID_691598576" CREATED="1389033252081" MODIFIED="1389033554291" LINK="http://www.rstqb.org/fileadmin/user_upload/redaktion/rstqb_ru/downloads/ISTQB_Glossary_Russian_v2_2.pdf"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      &#x421;&#x442;&#x430;&#x43d;&#x434;&#x430;&#x440;&#x442;&#x43d;&#x44b;&#x439; &#x433;&#x43b;&#x43e;&#x441;&#x441;&#x430;&#x440;&#x438;&#x439; &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d;&#x43e;&#x432;, &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x43c;&#x44b;&#x445; &#x432; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;
    </p>
    <p>
      &#x412;&#x435;&#x440;&#x441;&#x438;&#x44f; 2.2 (&#x43e;&#x442; 15 &#x410;&#x43f;&#x440;&#x435;&#x43b;&#x44f; 2013 &#x433;&#x43e;&#x434;&#x430;)
    </p>
    <p>
      &#x41f;&#x43e;&#x434;&#x433;&#x43e;&#x442;&#x43e;&#x432;&#x43b;&#x435;&#x43d; "Glossary Working Party" International Software Testing Qualifications Board
    </p>
    <p>
      http://www.rstqb.org/fileadmin/user_upload/redaktion/rstqb_ru/downloads/ISTQB_Glossary_Russian_v2_2.pdf
    </p>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="SWEBOK" ID="ID_817521948" CREATED="1389032867719" MODIFIED="1389033927126"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      SWEBOK
    </p>
    <p>
      &#x414;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x43f;&#x43e;&#x434;&#x433;&#x43e;&#x442;&#x43e;&#x432;&#x43b;&#x435;&#x43d; Software Engineering Coordinating Committee.
    </p>
    <p>
      &#x41d;&#x430;&#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x438;&#x435; SWEBOK - &#x432; &#x43e;&#x431;&#x44a;&#x435;&#x434;&#x438;&#x43d;&#x435;&#x43d;&#x438;&#x438; &#x437;&#x43d;&#x430;&#x43d;&#x438;&#x439; &#x43f;&#x43e; &#x438;&#x43d;&#x436;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; (&#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x435; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f;).
    </p>
  </body>
</html></richcontent>
<node TEXT="Основы Программной Инженерии (по SWEBOK)" ID="ID_811030565" CREATED="1389033915682" MODIFIED="1389034004443" LINK="http://swebok.sorlik.ru/"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      &#x41e;&#x441;&#x43d;&#x43e;&#x432;&#x44b; &#x41f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x439; &#x418;&#x43d;&#x436;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x438; (&#x43f;&#x43e; SWEBOK)
    </p>
    <p>
      &#x420;&#x443;&#x441;&#x441;&#x43a;&#x438;&#x439; &#x43f;&#x435;&#x440;&#x435;&#x432;&#x43e;&#x434; SWEBOK 2004 &#x441; &#x437;&#x430;&#x43c;&#x435;&#x447;&#x430;&#x43d;&#x438;&#x44f;&#x43c;&#x438; &#x438; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x440;&#x438;&#x44f;&#x43c;&#x438; &#x43f;&#x43e;&#x434;&#x433;&#x43e;&#x442;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x44b; &#x421;&#x435;&#x440;&#x433;&#x435;&#x435;&#x43c; &#x41e;&#x440;&#x43b;&#x438;&#x43a;&#x43e;&#x43c; &#x43f;&#x440;&#x438; &#x443;&#x447;&#x430;&#x441;&#x442;&#x438;&#x438; &#x42e;&#x440;&#x438;&#x44f; &#x411;&#x443;&#x43b;&#x443;&#x44f;. &#x414;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x435; &#x433;&#x43b;&#x430;&#x432;&#x44b; &#x43d;&#x430;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x44b; &#x421;&#x435;&#x440;&#x433;&#x435;&#x435;&#x43c; &#x41e;&#x440;&#x43b;&#x438;&#x43a;&#x43e;&#x43c;.
    </p>
    <p>
      &#x421;&#x441;&#x44b;&#x43b;&#x43a;&#x438;:
    </p>
    <ol>
      <li>
        http://swebok.sorlik.ru/
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
<node TEXT="IEEE SWEBOK (2004)" ID="ID_339563092" CREATED="1389034005883" MODIFIED="1389034359082" LINK="http://www.computer.org/portal/web/swebok/htmlformat"><richcontent TYPE="NOTE" CONTENT-TYPE="xml/">
<html>
  <head>
    
  </head>
  <body>
    <p>
      SWEBOK - <b>S</b>oft<b>w</b>are <b>E</b>ngineering <b>B</b>ody <b>o</b>f <b>K</b>nowledge
    </p>
    <p>
      &#x421;&#x441;&#x44b;&#x43b;&#x43a;&#x438;:
    </p>
    <ol>
      <li>
        http://www.swebok.org/
      </li>
      <li>
        http://www.computer.org/portal/web/swebok/2004guide
      </li>
    </ol>
  </body>
</html></richcontent>
</node>
</node>
<node TEXT="Книга &quot;Гибкое тестирование...&quot;, Криспин и др." ID="ID_879570431" CREATED="1389032879901" MODIFIED="1389032881917"/>
<node TEXT="Книга &quot;Тестирование программного обеспечения&quot;, Канер и др." ID="ID_1755287813" CREATED="1389032895594" MODIFIED="1389032897381"/>
<node TEXT="Книга &quot;Верификация программного обеспечения&quot;, Синицын и др." ID="ID_1628319587" CREATED="1389032907830" MODIFIED="1389033114309"/>
<node TEXT="Книга &quot;Usability Engineering&quot;, Nielsen" ID="ID_480348509" CREATED="1389032918385" MODIFIED="1389032920381"/>
<node TEXT="Глоссарий NIAG" ID="ID_175998486" CREATED="1389032928104" MODIFIED="1389032929834"/>
<node TEXT="Сайт &quot;Про Тестинг&quot;" ID="ID_433570444" CREATED="1389032938563" MODIFIED="1389032940557"/>
<node TEXT="Глоссарий НПО Компьютер" ID="ID_1380256952" CREATED="1389032947661" MODIFIED="1389032949201"/>
</node>
</node>
</map>
